Tekla Open API Reference for Tekla Structures 2025
AnalysisSupport.SupportEnum Enumeration
 The connectivity types.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum SupportEnum
Public Enumeration SupportEnum
Members
Member name | Value | Description
SUPPORT_FREE | 0 |  The support is free.
SUPPORT_FIXED | 1 |  The support is fixed.
SUPPORT_SPRING | 2 |  The support is a spring.
See Also
Reference
Tekla.Structures.Analysis Namespace